; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 12232)
	(= (fuel plane1) 2073)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at person1 city1)
	(at person2 city0)
	(at person3 city4)
	(at person4 city2)
	(at person5 city5)
	(at person6 city4)
	(at person7 city4)
	(at person8 city0)
	(at person9 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 868)
	(= (distance city0 city2) 829)
	(= (distance city0 city3) 608)
	(= (distance city0 city4) 894)
	(= (distance city0 city5) 770)
	(= (distance city1 city0) 868)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 924)
	(= (distance city1 city3) 983)
	(= (distance city1 city4) 763)
	(= (distance city1 city5) 732)
	(= (distance city2 city0) 829)
	(= (distance city2 city1) 924)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 545)
	(= (distance city2 city4) 911)
	(= (distance city2 city5) 518)
	(= (distance city3 city0) 608)
	(= (distance city3 city1) 983)
	(= (distance city3 city2) 545)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 541)
	(= (distance city3 city5) 562)
	(= (distance city4 city0) 894)
	(= (distance city4 city1) 763)
	(= (distance city4 city2) 911)
	(= (distance city4 city3) 541)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 852)
	(= (distance city5 city0) 770)
	(= (distance city5 city1) 732)
	(= (distance city5 city2) 518)
	(= (distance city5 city3) 562)
	(= (distance city5 city4) 852)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city0)
	(at person2 city2)
	(at person3 city3)
	(at person4 city2)
	(at person5 city5)
	(at person6 city5)
	(at person7 city3)
	(at person8 city2)
	(at person9 city1)
	))

(:metric minimize (+ (* 4 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (board person3 plane1 city4)
   deleted: (at person3 city4)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 9
2. (board person6 plane1 city4)
   deleted: (at person6 city4)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 9
3. (board person7 plane1 city4)
   deleted: (at person7 city4)
   added: (in person7 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 2 of 9
4. (refuel plane1 city4)
   changed: (fuel plane1) from 2073 to 12232
   goals met: 2 of 9
5. (fly plane1 city4 city0)
   deleted: (at plane1 city4)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 3576, (fuel plane1) from 12232 to 8656
   goals met: 2 of 9
6. (board person2 plane1 city0)
   deleted: (at person2 city0)
   added: (in person2 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 2 of 9
7. (board person8 plane1 city0)
   deleted: (at person8 city0)
   added: (in person8 plane1)
   changed: (onboard plane1) from 4 to 5
   goals met: 2 of 9
8. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 3576 to 6892, (fuel plane1) from 8656 to 5340
   goals met: 2 of 9
9. (debark person2 plane1 city2)
   deleted: (in person2 plane1)
   added: (at person2 city2)
   changed: (onboard plane1) from 5 to 4
   goals met: 3 of 9
10. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   changed: (onboard plane1) from 4 to 3
   goals met: 4 of 9
11. (fly plane1 city2 city5)
   deleted: (at plane1 city2)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 6892 to 8964, (fuel plane1) from 5340 to 3268
   goals met: 4 of 9
12. (debark person6 plane1 city5)
   deleted: (in person6 plane1)
   added: (at person6 city5)
   changed: (onboard plane1) from 3 to 2
   goals met: 5 of 9
13. (fly plane1 city5 city0)
   deleted: (at plane1 city5)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 8964 to 12044, (fuel plane1) from 3268 to 188
   goals met: 5 of 9
14. (refuel plane1 city0)
   changed: (fuel plane1) from 188 to 12232
   goals met: 5 of 9
15. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 12044 to 14476, (fuel plane1) from 12232 to 9800
   goals met: 5 of 9
16. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 9
17. (debark person7 plane1 city3)
   deleted: (in person7 plane1)
   added: (at person7 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 9
18. (board person9 plane1 city3)
   deleted: (at person9 city3)
   added: (in person9 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 9
19. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 14476 to 18408, (fuel plane1) from 9800 to 5868
   goals met: 7 of 9
20. (debark person9 plane1 city1)
   deleted: (in person9 plane1)
   added: (at person9 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 9
21. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 8 of 9
22. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 18408 to 21880, (fuel plane1) from 5868 to 2396
   goals met: 8 of 9
23. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 9
